---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.FbxAssetType
source: html/aae49538-debb-05d6-b622-a84fb5c5cdc1.htm
---
# Autodesk.Revit.DB.ParameterTypeId.FbxAssetType Property

"Light Source"

## Syntax (C#)
```csharp
public static ForgeTypeId FbxAssetType { get; }
```